Tekla.Structures.Drawing.DatabaseObject.PropertyQueryType
Direction of property setters

Tekla.Structures.Drawing.DatabaseObject.PropertyQueryType.GET
Get from TS

Tekla.Structures.Drawing.DatabaseObject.PropertyQueryType.SET
Set to TS